<template>
  <div class="message-detail">
    <common-header title="消息详情" to="/feedback/message" />
    <header>
      <h4>根据您在2021年4月1日的反馈，给予以下回复。</h4>
      <div class="author">
        <p class="author-name">灵犀MAX</p>
        <p class="time">2021-04-19</p>
      </div>
    </header>
    <div class="content">
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
      1.能够控制角色的移动和移动方向。
      虚拟摇杆的底盘固定在屏幕左下角，指针的运动范围是底盘的内部与底盘的边缘，指针的指向反应角色的移动方向。玩家没有触碰屏幕时指针不显示。玩家触碰屏幕时指针位于圆盘的中央，指向北边，如图：
      摇杆默认位置
      玩家离初始触摸的位置拖动偏移位置越远，指针也相对偏移，直到达到最大偏移量。
      2.技能按钮 小地图 很显然，我们需要一个能够让角色走动的场景。
    </div>
  </div>
</template>

<script>
import CommonHeader from "../../components/CommonHeader.vue";
export default {
  components: { CommonHeader },
  name: "MessageDetail",
};
</script>

<style lang="less" scoped>
.message-detail {
  width: 100%;
  height: 100%;
  header {
    width: 100%;
    box-sizing: border-box;
    padding: 12px 16px 20px 16px;
    font-family: "PingFang SC";
    h4 {
      width: 100%;
      font-size: 18px;
      font-weight: bold;
      line-height: 27px;
      color: #1e262f;
    }
  }
  .author {
    margin-top: 15px;
    width: 100%;
    display: flex;
    align-items: center;
    justify-content: space-between;
    font-family: "PingFang SC";
    font-weight: 400;
    .author-name {
      font-size: 13px;
      color: #0291ff;
    }
    .time {
      font-size: 12px;
      color: #1e262f;
    }
  }
  .content {
    margin: 0 auto;
    width: 343px;
    height: 470px;
    background: #e8ecf1;
    opacity: 1;
    border-radius: 10px;
    box-sizing: border-box;
    padding: 15px;
    overflow-y: scroll;
    font-size: 12px;
    font-family: "PingFang SC";
    font-weight: 500;
    line-height: 15px;
    color: #1e262f;
  }
}
</style>
